MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ09GS302/mcu.h
/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1CTSR RPINR18bits.U1CTSR
#define _U1RXR0 RPINR18bits.U1RXR0
#define _U1RXR1 RPINR18bits.U1RXR1
#define _U1RXR2 RPINR18bits.U1RXR2
#define _U1RXR3 RPINR18bits.U1RXR3
#define _U1RXR4 RPINR18bits.U1RXR4
#define _U1RXR5 RPINR18bits.U1RXR5
#define _U1CTSR0 RPINR18bits.U1CTSR0
#define _U1CTSR1 RPINR18bits.U1CTSR1
#define _U1CTSR2 RPINR18bits.U1CTSR2
#define _U1CTSR3 RPINR18bits.U1CTSR3
#define _U1CTSR4 RPINR18bits.U1CTSR4
#define _U1CTSR5 RPINR18bits.U1CTSR5

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1R RPINR20bits.SCK1R
#define _SDI1R0 RPINR20bits.SDI1R0
#define _SDI1R1 RPINR20bits.SDI1R1
#define _SDI1R2 RPINR20bits.SDI1R2
#define _SDI1R3 RPINR20bits.SDI1R3
#define _SDI1R4 RPINR20bits.SDI1R4
#define _SDI1R5 RPINR20bits.SDI1R5
#define _SCK1R0 RPINR20bits.SCK1R0
#define _SCK1R1 RPINR20bits.SCK1R1
#define _SCK1R2 RPINR20bits.SCK1R2
#define _SCK1R3 RPINR20bits.SCK1R3
#define _SCK1R4 RPINR20bits.SCK1R4
#define _SCK1R5 RPINR20bits.SCK1R5

/* RPINR21 */
#define _SS1R RPINR21bits.SS1R
#define _SS1R0 RPINR21bits.SS1R0
#define _SS1R1 RPINR21bits.SS1R1
#define _SS1R2 RPINR21bits.SS1R2
#define _SS1R3 RPINR21bits.SS1R3
#define _SS1R4 RPINR21bits.SS1R4
#define _SS1R5 RPINR21bits.SS1R5

/* RPINR29 */
#define _FLT1R RPINR29bits.FLT1R
#define _FLT1R0 RPINR29bits.FLT1R0
#define _FLT1R1 RPINR29bits.FLT1R1
#define _FLT1R2 RPINR29bits.FLT1R2
#define _FLT1R3 RPINR29bits.FLT1R3
#define _FLT1R4 RPINR29bits.FLT1R4
#define _FLT1R5 RPINR29bits.FLT1R5

/* RPINR30 */
#define _FLT2R RPINR30bits.FLT2R
#define _FLT3R RPINR30bits.FLT3R
#define _FLT2R0 RPINR30bits.FLT2R0
#define _FLT2R1 RPINR30bits.FLT2R1
#define _FLT2R2 RPINR30bits.FLT2R2
#define _FLT2R3 RPINR30bits.FLT2R3
#define _FLT2R4 RPINR30bits.FLT2R4
#define _FLT2R5 RPINR30bits.FLT2R5
#define _FLT3R0 RPINR30bits.FLT3R0
#define _FLT3R1 RPINR30bits.FLT3R1
#define _FLT3R2 RPINR30bits.FLT3R2
#define _FLT3R3 RPINR30bits.FLT3R3
#define _FLT3R4 RPINR30bits.FLT3R4
#define _FLT3R5 RPINR30bits.FLT3R5

/* RPINR31 */
#define _FLT4R RPINR31bits.FLT4R
#define _FLT5R RPINR31bits.FLT5R
#define _FLT4R0 RPINR31bits.FLT4R0
#define _FLT4R1 RPINR31bits.FLT4R1
#define _FLT4R2 RPINR31bits.FLT4R2
#define _FLT4R3 RPINR31bits.FLT4R3
#define _FLT4R4 RPINR31bits.FLT4R4
#define _FLT4R5 RPINR31bits.FLT4R5
#define _FLT5R0 RPINR31bits.FLT5R0
#define _FLT5R1 RPINR31bits.FLT5R1
#define _FLT5R2 RPINR31bits.FLT5R2
#define _FLT5R3 RPINR31bits.FLT5R3
#define _FLT5R4 RPINR31bits.FLT5R4
#define _FLT5R5 RPINR31bits.FLT5R5

/* RPINR32 */
#define _FLT6R RPINR32bits.FLT6R
#define _FLT7R RPINR32bits.FLT7R
#define _FLT6R0 RPINR32bits.FLT6R0
#define _FLT6R1 RPINR32bits.FLT6R1
#define _FLT6R2 RPINR32bits.FLT6R2
#define _FLT6R3 RPINR32bits.FLT6R3
#define _FLT6R4 RPINR32bits.FLT6R4
#define _FLT6R5 RPINR32bits.FLT6R5
#define _FLT7R0 RPINR32bits.FLT7R0
#define _FLT7R1 RPINR32bits.FLT7R1
#define _FLT7R2 RPINR32bits.FLT7R2
#define _FLT7R3 RPINR32bits.FLT7R3
#define _FLT7R4 RPINR32bits.FLT7R4
#define _FLT7R5 RPINR32bits.FLT7R5

/* RPINR33 */
#define _FLT8R RPINR33bits.FLT8R
#define _SYNCI1R RPINR33bits.SYNCI1R
#define _FLT8R0 RPINR33bits.FLT8R0
#define _FLT8R1 RPINR33bits.FLT8R1
#define _FLT8R2 RPINR33bits.FLT8R2
#define _FLT8R3 RPINR33bits.FLT8R3
#define _FLT8R4 RPINR33bits.FLT8R4
#define _FLT8R5 RPINR33bits.FLT8R5
#define _SYNCI1R0 RPINR33bits.SYNCI1R0
#define _SYNCI1R1 RPINR33bits.SYNCI1R1
#define _SYNCI1R2 RPINR33bits.SYNCI1R2
#define _SYNCI1R3 RPINR33bits.SYNCI1R3
#define _SYNCI1R4 RPINR33bits.SYNCI1R4
#define _SYNCI1R5 RPINR33bits.SYNCI1R5

/* RPINR34 */
#define _SYNCI2R RPINR34bits.SYNCI2R
#define _SYNCI2R0 RPINR34bits.SYNCI2R0
#define _SYNCI2R1 RPINR34bits.SYNCI2R1
#define _SYNCI2R2 RPINR34bits.SYNCI2R2
#define _SYNCI2R3 RPINR34bits.SYNCI2R3
#define _SYNCI2R4 RPINR34bits.SYNCI2R4
#define _SYNCI2R5 RPINR34bits.SYNCI2R5

/* RPOR0 */
#define _RP0R RPOR0bits.RP0R
#define _RP1R RPOR0bits.RP1R
#define _RP0R0 RPOR0bits.RP0R0
#define _RP0R1 RPOR0bits.RP0R1
#define _RP0R2 RPOR0bits.RP0R2
#define _RP0R3 RPOR0bits.RP0R3
#define _RP0R4 RPOR0bits.RP0R4
#define _RP0R5 RPOR0bits.RP0R5
#define _RP1R0 RPOR0bits.RP1R0
#define _RP1R1 RPOR0bits.RP1R1
#define _RP1R2 RPOR0bits.RP1R2
#define _RP1R3 RPOR0bits.RP1R3
#define _RP1R4 RPOR0bits.RP1R4
#define _RP1R5 RPOR0bits.RP1R5

/* RPOR1 */
#define _RP2R RPOR1bits.RP2R
#define _RP3R RPOR1bits.RP3R
#define _RP2R0 RPOR1bits.RP2R0
#define _RP2R1 RPOR1bits.RP2R1
#define _RP2R2 RPOR1bits.RP2R2
#define _RP2R3 RPOR1bits.RP2R3
#define _RP2R4 RPOR1bits.RP2R4
#define _RP2R5 RPOR1bits.RP2R5
#define _RP3R0 RPOR1bits.RP3R0
#define _RP3R1 RPOR1bits.RP3R1
#define _RP3R2 RPOR1bits.RP3R2
#define _RP3R3 RPOR1bits.RP3R3
#define _RP3R4 RPOR1bits.RP3R4
#define _RP3R5 RPOR1bits.RP3R5

/* RPOR2 */
#define _RP4R RPOR2bits.RP4R
#define _RP5R RPOR2bits.RP5R
#define _RP4R0 RPOR2bits.RP4R0
#define _RP4R1 RPOR2bits.RP4R1
#define _RP4R2 RPOR2bits.RP4R2
#define _RP4R3 RPOR2bits.RP4R3
#define _RP4R4 RPOR2bits.RP4R4
#define _RP4R5 RPOR2bits.RP4R5
#define _RP5R0 RPOR2bits.RP5R0
#define _RP5R1 RPOR2bits.RP5R1
#define _RP5R2 RPOR2bits.RP5R2
#define _RP5R3 RPOR2bits.RP5R3
#define _RP5R4 RPOR2bits.RP5R4
#define _RP5R5 RPOR2bits.RP5R5

/* RPOR3 */
#define _RP6R RPOR3bits.RP6R
#define _RP7R RPOR3bits.RP7R
#define _RP6R0 RPOR3bits.RP6R0
#define _RP6R1 RPOR3bits.RP6R1
#define _RP6R2 RPOR3bits.RP6R2
#define _RP6R3 RPOR3bits.RP6R3
#define _RP6R4 RPOR3bits.RP6R4
#define _RP6R5 RPOR3bits.RP6R5
#define _RP7R0 RPOR3bits.RP7R0
#define _RP7R1 RPOR3bits.RP7R1
#define _RP7R2 RPOR3bits.RP7R2
#define _RP7R3 RPOR3bits.RP7R3
#define _RP7R4 RPOR3bits.RP7R4
#define _RP7R5 RPOR3bits.RP7R5

/* RPOR4 */
#define _RP8R RPOR4bits.RP8R
#define _RP9R RPOR4bits.RP9R
#define _RP8R0 RPOR4bits.RP8R0
#define _RP8R1 RPOR4bits.RP8R1
#define _RP8R2 RPOR4bits.RP8R2
#define _RP8R3 RPOR4bits.RP8R3
#define _RP8R4 RPOR4bits.RP8R4
#define _RP8R5 RPOR4bits.RP8R5
#define _RP9R0 RPOR4bits.RP9R0
#define _RP9R1 RPOR4bits.RP9R1
#define _RP9R2 RPOR4bits.RP9R2
#define _RP9R3 RPOR4bits.RP9R3
#define _RP9R4 RPOR4bits.RP9R4
#define _RP9R5 RPOR4bits.RP9R5

/* RPOR5 */
#define _RP10R RPOR5bits.RP10R
#define _RP11R RPOR5bits.RP11R
#define _RP10R0 RPOR5bits.RP10R0
#define _RP10R1 RPOR5bits.RP10R1
#define _RP10R2 RPOR5bits.RP10R2
#define _RP10R3 RPOR5bits.RP10R3
#define _RP10R4 RPOR5bits.RP10R4
#define _RP10R5 RPOR5bits.RP10R5
#define _RP11R0 RPOR5bits.RP11R0
#define _RP11R1 RPOR5bits.RP11R1
#define _RP11R2 RPOR5bits.RP11R2
#define _RP11R3 RPOR5bits.RP11R3
#define _RP11R4 RPOR5bits.RP11R4
#define _RP11R5 RPOR5bits.RP11R5

/* RPOR6 */
#define _RP12R RPOR6bits.RP12R
#define _RP13R RPOR6bits.RP13R
#define _RP12R0 RPOR6bits.RP12R0
#define _RP12R1 RPOR6bits.RP12R1
#define _RP12R2 RPOR6bits.RP12R2
#define _RP12R3 RPOR6bits.RP12R3
#define _RP12R4 RPOR6bits.RP12R4
#define _RP12R5 RPOR6bits.RP12R5
#define _RP13R0 RPOR6bits.RP13R0
#define _RP13R1 RPOR6bits.RP13R1
#define _RP13R2 RPOR6bits.RP13R2
#define _RP13R3 RPOR6bits.RP13R3
#define _RP13R4 RPOR6bits.RP13R4
#define _RP13R5 RPOR6bits.RP13R5

