MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ09GS302/mcu.h
#define _FCLCON4_CLSRC_POSITION                  0x0000000A
#define _FCLCON4_CLSRC_MASK                      0x00007C00
#define _FCLCON4_CLSRC_LENGTH                    0x00000005

#define _FCLCON4_IFLTMOD_POSITION                0x0000000F
#define _FCLCON4_IFLTMOD_MASK                    0x00008000
#define _FCLCON4_IFLTMOD_LENGTH                  0x00000001

#define _DTR4_DTR4_POSITION                      0x00000000
#define _DTR4_DTR4_MASK                          0x00003FFF
#define _DTR4_DTR4_LENGTH                        0x0000000E

#define _ALTDTR4_ALTDTR4_POSITION                0x00000000
#define _ALTDTR4_ALTDTR4_MASK                    0x00003FFF
#define _ALTDTR4_ALTDTR4_LENGTH                  0x0000000E

#define _TRIG4_TRGCMP_POSITION                   0x00000003
#define _TRIG4_TRGCMP_MASK                       0x0000FFF8
#define _TRIG4_TRGCMP_LENGTH                     0x0000000D

#define _TRGCON4_TRGSTRT_POSITION                0x00000000
#define _TRGCON4_TRGSTRT_MASK                    0x0000003F
#define _TRGCON4_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON4_DTM_POSITION                    0x00000007
#define _TRGCON4_DTM_MASK                        0x00000080
#define _TRGCON4_DTM_LENGTH                      0x00000001

#define _TRGCON4_TRGDIV_POSITION                 0x0000000C
#define _TRGCON4_TRGDIV_MASK                     0x0000F000
#define _TRGCON4_TRGDIV_LENGTH                   0x00000004

#define _STRIG4_STRGCMP_POSITION                 0x00000003
#define _STRIG4_STRGCMP_MASK                     0x0000FFF8
#define _STRIG4_STRGCMP_LENGTH                   0x0000000D

#define _PWMCAP4_PWMCAP4_POSITION                0x00000003
#define _PWMCAP4_PWMCAP4_MASK                    0x0000FFF8
#define _PWMCAP4_PWMCAP4_LENGTH                  0x0000000D

#define _LEBCON4_LEB_POSITION                    0x00000003
#define _LEBCON4_LEB_MASK                        0x000003F8
#define _LEBCON4_LEB_LENGTH                      0x00000007

#define _LEBCON4_CLLEBEN_POSITION                0x0000000A
#define _LEBCON4_CLLEBEN_MASK                    0x00000400
#define _LEBCON4_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON4_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON4_FLTLEBEN_MASK                   0x00000800
#define _LEBCON4_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON4_PLF_POSITION                    0x0000000C
#define _LEBCON4_PLF_MASK                        0x00001000
#define _LEBCON4_PLF_LENGTH                      0x00000001

#define _LEBCON4_PLR_POSITION                    0x0000000D
#define _LEBCON4_PLR_MASK                        0x00002000
#define _LEBCON4_PLR_LENGTH                      0x00000001

#define _LEBCON4_PHF_POSITION                    0x0000000E
#define _LEBCON4_PHF_MASK                        0x00004000
#define _LEBCON4_PHF_LENGTH                      0x00000001

#define _LEBCON4_PHR_POSITION                    0x0000000F
#define _LEBCON4_PHR_MASK                        0x00008000
#define _LEBCON4_PHR_LENGTH                      0x00000001

#define _AUXCON4_CHOPLEN_POSITION                0x00000000
#define _AUXCON4_CHOPLEN_MASK                    0x00000001
#define _AUXCON4_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPHEN_POSITION                0x00000001
#define _AUXCON4_CHOPHEN_MASK                    0x00000002
#define _AUXCON4_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON4_CHOPSEL_POSITION                0x00000002
#define _AUXCON4_CHOPSEL_MASK                    0x0000003C
#define _AUXCON4_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON4_HRDDIS_POSITION                 0x0000000E
#define _AUXCON4_HRDDIS_MASK                     0x00004000
#define _AUXCON4_HRDDIS_LENGTH                   0x00000001

#define _AUXCON4_HRPDIS_POSITION                 0x0000000F
#define _AUXCON4_HRPDIS_MASK                     0x00008000
#define _AUXCON4_HRPDIS_LENGTH                   0x00000001

#define _ISRCCON_ISRCCAL_POSITION                0x00000000
#define _ISRCCON_ISRCCAL_MASK                    0x0000003F
#define _ISRCCON_ISRCCAL_LENGTH                  0x00000006

#define _ISRCCON_OUTSEL_POSITION                 0x00000008
#define _ISRCCON_OUTSEL_MASK                     0x00000700
#define _ISRCCON_OUTSEL_LENGTH                   0x00000003

#define _ISRCCON_ISRCEN_POSITION                 0x0000000F
#define _ISRCCON_ISRCEN_MASK                     0x00008000
#define _ISRCCON_ISRCEN_LENGTH                   0x00000001

#define _ISRCCON_ISRCCAL0_POSITION               0x00000000
#define _ISRCCON_ISRCCAL0_MASK                   0x00000001
#define _ISRCCON_ISRCCAL0_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL1_POSITION               0x00000001
#define _ISRCCON_ISRCCAL1_MASK                   0x00000002
#define _ISRCCON_ISRCCAL1_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL2_POSITION               0x00000002
#define _ISRCCON_ISRCCAL2_MASK                   0x00000004
#define _ISRCCON_ISRCCAL2_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL3_POSITION               0x00000003
#define _ISRCCON_ISRCCAL3_MASK                   0x00000008
#define _ISRCCON_ISRCCAL3_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL4_POSITION               0x00000004
#define _ISRCCON_ISRCCAL4_MASK                   0x00000010
#define _ISRCCON_ISRCCAL4_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL5_POSITION               0x00000005
#define _ISRCCON_ISRCCAL5_MASK                   0x00000020
#define _ISRCCON_ISRCCAL5_LENGTH                 0x00000001

#define _ISRCCON_OUTSEL0_POSITION                0x00000008
#define _ISRCCON_OUTSEL0_MASK                    0x00000100
#define _ISRCCON_OUTSEL0_LENGTH                  0x00000001

#define _ISRCCON_OUTSEL1_POSITION                0x00000009
#define _ISRCCON_OUTSEL1_MASK                    0x00000200
#define _ISRCCON_OUTSEL1_LENGTH                  0x00000001

#define _ISRCCON_OUTSEL2_POSITION                0x0000000A
#define _ISRCCON_OUTSEL2_MASK                    0x00000400
#define _ISRCCON_OUTSEL2_LENGTH                  0x00000001

#define _CMPCON1_RANGE_POSITION                  0x00000000
#define _CMPCON1_RANGE_MASK                      0x00000001
#define _CMPCON1_RANGE_LENGTH                    0x00000001

#define _CMPCON1_CMPPOL_POSITION                 0x00000001
#define _CMPCON1_CMPPOL_MASK                     0x00000002
#define _CMPCON1_CMPPOL_LENGTH                   0x00000001

#define _CMPCON1_HGAIN_POSITION                  0x00000002
#define _CMPCON1_HGAIN_MASK                      0x00000004
#define _CMPCON1_HGAIN_LENGTH                    0x00000001

#define _CMPCON1_CMPSTAT_POSITION                0x00000003
#define _CMPCON1_CMPSTAT_MASK                    0x00000008
#define _CMPCON1_CMPSTAT_LENGTH                  0x00000001

