MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ09GS302/mcu.h
#define _CMPCON1_HYSPOL_POSITION                 0x00000004
#define _CMPCON1_HYSPOL_MASK                     0x00000010
#define _CMPCON1_HYSPOL_LENGTH                   0x00000001

#define _CMPCON1_EXTREF_POSITION                 0x00000005
#define _CMPCON1_EXTREF_MASK                     0x00000020
#define _CMPCON1_EXTREF_LENGTH                   0x00000001

#define _CMPCON1_INSEL_POSITION                  0x00000006
#define _CMPCON1_INSEL_MASK                      0x000000C0
#define _CMPCON1_INSEL_LENGTH                    0x00000002

#define _CMPCON1_DACOE_POSITION                  0x00000008
#define _CMPCON1_DACOE_MASK                      0x00000100
#define _CMPCON1_DACOE_LENGTH                    0x00000001

#define _CMPCON1_FCLKSEL_POSITION                0x00000009
#define _CMPCON1_FCLKSEL_MASK                    0x00000200
#define _CMPCON1_FCLKSEL_LENGTH                  0x00000001

#define _CMPCON1_FLTREN_POSITION                 0x0000000A
#define _CMPCON1_FLTREN_MASK                     0x00000400
#define _CMPCON1_FLTREN_LENGTH                   0x00000001

#define _CMPCON1_HYSSEL_POSITION                 0x0000000B
#define _CMPCON1_HYSSEL_MASK                     0x00001800
#define _CMPCON1_HYSSEL_LENGTH                   0x00000002

#define _CMPCON1_CMPSIDL_POSITION                0x0000000D
#define _CMPCON1_CMPSIDL_MASK                    0x00002000
#define _CMPCON1_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON1_CMPON_POSITION                  0x0000000F
#define _CMPCON1_CMPON_MASK                      0x00008000
#define _CMPCON1_CMPON_LENGTH                    0x00000001

#define _CMPCON1_INSEL0_POSITION                 0x00000006
#define _CMPCON1_INSEL0_MASK                     0x00000040
#define _CMPCON1_INSEL0_LENGTH                   0x00000001

#define _CMPCON1_INSEL1_POSITION                 0x00000007
#define _CMPCON1_INSEL1_MASK                     0x00000080
#define _CMPCON1_INSEL1_LENGTH                   0x00000001

#define _CMPDAC1_CMREF_POSITION                  0x00000000
#define _CMPDAC1_CMREF_MASK                      0x000003FF
#define _CMPDAC1_CMREF_LENGTH                    0x0000000A

#define _CMPDAC1_CMREF0_POSITION                 0x00000000
#define _CMPDAC1_CMREF0_MASK                     0x00000001
#define _CMPDAC1_CMREF0_LENGTH                   0x00000001

#define _CMPDAC1_CMREF1_POSITION                 0x00000001
#define _CMPDAC1_CMREF1_MASK                     0x00000002
#define _CMPDAC1_CMREF1_LENGTH                   0x00000001

#define _CMPDAC1_CMREF2_POSITION                 0x00000002
#define _CMPDAC1_CMREF2_MASK                     0x00000004
#define _CMPDAC1_CMREF2_LENGTH                   0x00000001

#define _CMPDAC1_CMREF3_POSITION                 0x00000003
#define _CMPDAC1_CMREF3_MASK                     0x00000008
#define _CMPDAC1_CMREF3_LENGTH                   0x00000001

#define _CMPDAC1_CMREF4_POSITION                 0x00000004
#define _CMPDAC1_CMREF4_MASK                     0x00000010
#define _CMPDAC1_CMREF4_LENGTH                   0x00000001

#define _CMPDAC1_CMREF5_POSITION                 0x00000005
#define _CMPDAC1_CMREF5_MASK                     0x00000020
#define _CMPDAC1_CMREF5_LENGTH                   0x00000001

#define _CMPDAC1_CMREF6_POSITION                 0x00000006
#define _CMPDAC1_CMREF6_MASK                     0x00000040
#define _CMPDAC1_CMREF6_LENGTH                   0x00000001

#define _CMPDAC1_CMREF7_POSITION                 0x00000007
#define _CMPDAC1_CMREF7_MASK                     0x00000080
#define _CMPDAC1_CMREF7_LENGTH                   0x00000001

#define _CMPDAC1_CMREF8_POSITION                 0x00000008
#define _CMPDAC1_CMREF8_MASK                     0x00000100
#define _CMPDAC1_CMREF8_LENGTH                   0x00000001

#define _CMPDAC1_CMREF9_POSITION                 0x00000009
#define _CMPDAC1_CMREF9_MASK                     0x00000200
#define _CMPDAC1_CMREF9_LENGTH                   0x00000001

#define _CMPCON2_RANGE_POSITION                  0x00000000
#define _CMPCON2_RANGE_MASK                      0x00000001
#define _CMPCON2_RANGE_LENGTH                    0x00000001

#define _CMPCON2_CMPPOL_POSITION                 0x00000001
#define _CMPCON2_CMPPOL_MASK                     0x00000002
#define _CMPCON2_CMPPOL_LENGTH                   0x00000001

#define _CMPCON2_HGAIN_POSITION                  0x00000002
#define _CMPCON2_HGAIN_MASK                      0x00000004
#define _CMPCON2_HGAIN_LENGTH                    0x00000001

#define _CMPCON2_CMPSTAT_POSITION                0x00000003
#define _CMPCON2_CMPSTAT_MASK                    0x00000008
#define _CMPCON2_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON2_HYSPOL_POSITION                 0x00000004
#define _CMPCON2_HYSPOL_MASK                     0x00000010
#define _CMPCON2_HYSPOL_LENGTH                   0x00000001

#define _CMPCON2_EXTREF_POSITION                 0x00000005
#define _CMPCON2_EXTREF_MASK                     0x00000020
#define _CMPCON2_EXTREF_LENGTH                   0x00000001

#define _CMPCON2_INSEL_POSITION                  0x00000006
#define _CMPCON2_INSEL_MASK                      0x000000C0
#define _CMPCON2_INSEL_LENGTH                    0x00000002

#define _CMPCON2_DACOE_POSITION                  0x00000008
#define _CMPCON2_DACOE_MASK                      0x00000100
#define _CMPCON2_DACOE_LENGTH                    0x00000001

#define _CMPCON2_FCLKSEL_POSITION                0x00000009
#define _CMPCON2_FCLKSEL_MASK                    0x00000200
#define _CMPCON2_FCLKSEL_LENGTH                  0x00000001

#define _CMPCON2_FLTREN_POSITION                 0x0000000A
#define _CMPCON2_FLTREN_MASK                     0x00000400
#define _CMPCON2_FLTREN_LENGTH                   0x00000001

#define _CMPCON2_HYSSEL_POSITION                 0x0000000B
#define _CMPCON2_HYSSEL_MASK                     0x00001800
#define _CMPCON2_HYSSEL_LENGTH                   0x00000002

#define _CMPCON2_CMPSIDL_POSITION                0x0000000D
#define _CMPCON2_CMPSIDL_MASK                    0x00002000
#define _CMPCON2_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON2_CMPON_POSITION                  0x0000000F
#define _CMPCON2_CMPON_MASK                      0x00008000
#define _CMPCON2_CMPON_LENGTH                    0x00000001

#define _CMPCON2_INSEL0_POSITION                 0x00000006
#define _CMPCON2_INSEL0_MASK                     0x00000040
#define _CMPCON2_INSEL0_LENGTH                   0x00000001

#define _CMPCON2_INSEL1_POSITION                 0x00000007
#define _CMPCON2_INSEL1_MASK                     0x00000080
#define _CMPCON2_INSEL1_LENGTH                   0x00000001

#define _CMPDAC2_CMREF_POSITION                  0x00000000
#define _CMPDAC2_CMREF_MASK                      0x000003FF
#define _CMPDAC2_CMREF_LENGTH                    0x0000000A

